GopalSaraf/Practicals/PSDL/include/pic18_chip_select.h
#ifdef _18LF8310
#include <pic18lf8310.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8390
#include <pic18lf8390.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8393
#include <pic18lf8393.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8410
#include <pic18lf8410.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8490
#include <pic18lf8490.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8493
#include <pic18lf8493.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8520
#include <pic18lf8520.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8525
#include <pic18lf8525.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8527
#include <pic18lf8527.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8585
#include <pic18lf8585.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8620
#include <pic18lf8620.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8621
#include <pic18lf8621.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8622
#include <pic18lf8622.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8627
#include <pic18lf8627.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8628
#include <pic18lf8628.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8680
#include <pic18lf8680.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8720
#include <pic18lf8720.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8722
#include <pic18lf8722.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8723
#include <pic18lf8723.h>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _TEST_CHIP_
#undef _HEADER_NOT_FOUND
#endif

#ifdef _HEADER_NOT_FOUND
#error Device-specific header could not be found for target chip
#endif

#endif // _PIC18_CHIP_SELECT_H_
